# FileNotFoundException Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FileNotFoundException Class
Members See Also
---
The exception that is thrown when the specified file could not be found.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
[SerializableAttribute]
public class FileNotFoundException : IOException
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class FileNotFoundException _
	Inherits IOException
```

Visual C++
---
```text
[SerializableAttribute]
public ref class FileNotFoundException : public IOException
```

# Inheritance Hierarchy
System..::..Object System..::..Exception Autodesk.Revit.Exceptions..::..ApplicationException Autodesk.Revit.Exceptions..::..IOException Autodesk.Revit.Exceptions..::..FileNotFoundException
# See Also
FileNotFoundException Members
Autodesk.Revit.Exceptions Namespace